#include "Әплюсплюс.hpp"

куярга Татарлар::юл_бетте;
куярга Татарлар::икесен_алып_эшләргә;

үзем_эшләдем <исеме_аның Т>

кирәкмәгән_нәрсә куык(Т* кешеләр, сан ничә) {
  бөтенесенә (компьютерның_көче караш1 = 0; караш1 < ничә; ++караш1) {
    бөтенесенә (компьютерның_көче караш2 = 0; караш2 < ничә; ++караш2) {
      булса (кешеләр[караш1] > кешеләр[караш2]) икесен_алып_эшләргә(кешеләр[караш1], кешеләр[караш2]);
    }
  }
}

башларга() {
  Татарлар::карагыз << "Эшли башладык!" << юл_бетте;

  // Безгә авылга җир бирделәр!
  сан күплек = 10000;
  сан* авыл = яңа сан[күплек];
  бөтенесенә (сан пот = күплек - 1; пот >= 0; --пот)
    авыл[пот] = пот + 1;
  // Бөтен авылда кешеләр яши
  куык(авыл, күплек);
  Татарлар::карагыз << "Эшләп бетердек, татарлар молодцы!" << юл_бетте;

  кирәкми авыл;
  бирергә яхшы;
}
