#include "Әплюсплюс.hpp"

куярга Татарлар::юл_бетте инде
куярга Татарлар::икесен_алып_эшләргә инде

үзем_эшләдем <исеме_аның Т>

кирәкмәгән_нәрсә куык(Т* кешеләр, сан ничә) {
  бөтенесенә (компьютерның_көче караш1 = 0 инде караш1 < ничә инде ++караш1) {
    бөтенесенә (компьютерның_көче караш2 = 0 инде караш2 < ничә инде ++караш2) {
      булса (кешеләр[караш1] > кешеләр[караш2]) икесен_алып_эшләргә(кешеләр[караш1], кешеләр[караш2]) инде
    }
  }
}

башларга() {
  Татарлар::карагыз << "Эшли башладык!" << юл_бетте инде

  // Безгә авылга җир бирделәр!
  сан күплек = 10000 инде
  сан* авыл = яңа сан[күплек] инде
  бөтенесенә (сан пот = күплек - 1 инде пот >= 0 инде --пот)
    авыл[пот] = пот + 1 инде
  // Бөтен авылда кешеләр яши
  куык(авыл, күплек) инде
  Татарлар::карагыз << "Эшләп бетердек, татарлар молодцы!" << юл_бетте инде

  кирәкми авыл инде
  бирергә яхшы инде
}
